Autodesk.Revit.DB.BuiltInFailures.StructuralConnectionFailures.StructuralSectionHasIncompleteDefinition
Structural Section has incomplete definition

Autodesk.Revit.DB.BuiltInFailures.StructuralConnectionFailures.StructuralConnectionWrongType
Structural Connection has an inappropriate type assigned.

Autodesk.Revit.DB.BuiltInFailures.StructuralConnectionFailures.StructuralConnectionTypeInfoNotAvailable
There is no add-on installed which supports Structural Connection type.

Autodesk.Revit.DB.BuiltInFailures.StructuralConnectionFailures.StructuralConnectionTypeChangedToGeneric
Structural Connection had an inappropriate type, which has been changed to 'Generic Connection'.

Autodesk.Revit.DB.BuiltInFailures.StructuralConnectionFailures.StructuralConnectionTooFarRefs
Structural Connection Handler cannot connect too far elements

Autodesk.Revit.DB.BuiltInFailures.StructuralConnectionFailures.StructuralConnectionTooFarNotEnoughRefs
Structural Connection Handler cannot connect too far elements

Autodesk.Revit.DB.BuiltInFailures.StructuralConnectionFailures.StructuralConnectionSetOfRefsChanged
The set of input elements was changed and the connection has been adjusted.

Autodesk.Revit.DB.BuiltInFailures.StructuralConnectionFailures.StructuralConnectionNotEnoughRefs
Structural Connection Handler cannot connect fewer than two elements.

Autodesk.Revit.DB.BuiltInFailures.StructuralConnectionFailures.StructuralConnectionNoSingleRef
Summary: Structural Connection Handler lost connected element.

Autodesk.Revit.DB.BuiltInFailures.StructuralConnectionFailures.StructuralConnectionForbiddenElementInGroup
Fabrication element can not be a group member.

Autodesk.Revit.DB.BuiltInFailures.StructuralConnectionFailures.StructuralConnectionCannotReplaceRefs
Structural Connection cannot replace elements

Autodesk.Revit.DB.BuiltInFailures.StructuralConnectionFailures.StructuralConnectionCannotGenerate
Could not create Structural Connection Handler

Autodesk.Revit.DB.BuiltInFailures.StructuralConnectionFailures
Failures about StructuralConnectionHandler.